Обработки/Reports/_ОСВбез7раздела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОСВбез7раздела</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьНаименованиеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОСВбез7раздела/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьНаСервере()
	
	ТекстСообщения = "";
	
	Если ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		Возврат РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ЭтаФорма.Результат, ЭтаФорма.Подписант, ЭтаФорма.ГруппировкиОтчета);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период");	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите счет доверительного управления",,, "Отчет.СчетДоверительногоУправления");
		Возврат;
	КонецЕсли;	
	
	СформироватьНаСервере();
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
		
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокГруппировок()
	
	СписокГруппировкиОтчета = РеквизитФормыВЗначение("Отчет").СоздатьГруппировкиОтчета();
	Для Каждого Элемент из СписокГруппировкиОтчета Цикл
		ЭтотОбъект.ГруппировкиОтчета.Добавить(Элемент.Значение, Элемент.Представление, Элемент.Пометка);
	КонецЦикла;	
	
КонецПроцедуры 	
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(ЭтаФорма, Отчет.Организация);
	ЗаполнитьСписокГруппировок();
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	ЭтаФорма.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	СформироватьНаСервере();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РаботаСОтчетамиКлиент.ПодписантОтчетаНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСОтчетамиКлиент.ПодписантОтчетаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение);	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	РаботаСОтчетамиКлиент.ПодписантОтчетаПриИзменении(ЭтаФорма);
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьНаименованиеСчетаПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры
